# ### python 运算符
"""
1算数运算符: + - * / // % **
2比较运算符 > < >= <= == !=
3赋值运算符: = += -= *= /= //= %= **=
4成员运算符:in 和 not in (针对于容器类型数据)
5身份运算符:is 和 is not (检测两个数据在内存当中是否是同一值)
6逻辑运算符: and or not
7位运算符: & 1 ~ ^ << >>
"""

#1算数运算符
# + -
var1 = 3
var2 = 5
res = var1 + var2
print(res)

# *(乘号)
res = var1 * var2
print(res)

# /(除号)结果一定是小数
res = var1 / var2
res = 8/4
print(res)

# // (地板除)
res = 8 // 4
# 如果除数和被除数其中有小数,那么结果是小数
res = 8 // 4.0
print(res)

# % 取余
res = var2 % var1
res = -7 % 4 #结果为1  -3 + 4 = 1
res = 7 % -4 #结果为-1   3 + -4 = -1
res = -7 % -4 #结果为-3 如果两边都是负号,就是单纯的在余数的前面套上负号即可
print(res)

# ** 幂运算
res = 3 ** 4
print(res)

# 2 比较运算符: < > >= <= == != 只会产生两个结果,要么是True真的,要么是False假的

var1 = 10
var2 = 6
# > < >= <=
res = var1 >= var2
print(res)

# == 比较两个值是否相等
'''
一个等号表示的是赋值,把右边的值赋值给左边
两个等号表示的是比较两个值是否相等,并返回一个布尔数据
'''
res = 5 == 5
print(res)
# != 比较两个值是否不相等

res = 5 != 5
print(res)




