# ### 列表相关操作
# (1) 列表的拼接 (同元组)
listvar1 = ['邹荣玲','留守乱','主进程','郭少东','桂少斌']
listvar2 = ['好价位']
res = listvar1 + listvar2
print(res)

# (2) 列表的重复 (同元组)
lst = ['吴荣泽','杨麻子']
res = lst * 3
print(lst)

# (3) 列表的切片 与字符串的切片相同
lst = ['邹永玲','留守乱','朱景城','郭少东','桂晓斌','张晓东']
# 1 [开始索引:] 从开始索引截取到列表的最后
res = lst[4:]

# 2 [:结束索引] 从列表的开始截取到结束索引之前(结束索引-1)
res = lst[:5]

# 3 [开始索引:结束索引] 从开始索引截取到结束索引之前(结束索引-1)
res = lst[1:6]

# 4 [开始索引:结束索引:间隔值] 从开始索引截取到结束索引之前按照指定的间隔截取列表
res = lst[::3]
# 0 3 6 9 12
res = lst[-2:-5:-2]
# -2 -4

# 5 [:] [::] 截取所有列表
res = lst[:]
res = lst[::]
print(res)

# (4)列表的获取 (同元组)
#	=  0 1 2 3
lst = [1,2,3,4]
#	= -4-3-2-1
res = lst[0]
res = lst[-4]
print(res)

# (5)列表的修改 (可切片)
lst = ['邹永玲','留守乱','朱景城','郭少东','桂晓斌','张晓东']
lst[1] = '罗晓云'
print(lst)

# 1 用切片进行修改
lst[2:4] = ("a","b","c") # 无需一一对应,即可以将列表中的2个元素,更改成3个,以此类推
print(lst)

# 2 用带有间隔值的切片进行修改
lst[2:6:2] = ['d','e'] # (截取几个,修改几个,元素要对应)
print(lst)

# (6) 列表的删除 (可切片) del
lst = ['邹永玲','留守乱','朱景城','郭少东','桂晓斌','张晓东']
# 1删除一个
del lst[-2]
print(lst)

# 2删除多个(利用切片删除)
del lst[1:4]
del lst[1:4:2]
# 1 3
print(lst)

# 注意点
"""
res = lst[1:4]
del res
print(lst)
"""

